# **Pandas**

## What is Pandas?

Pandas is a Python library <ins>used for data manipulation and analysis</ins>, providing data structures like DataFrames that allow for easy handling of structured data such as tables.


## Why Pandas?

- Simple to use
- Integrated with many other data science & ML Python tools such as NumPy, Matplotlib, Scikit-learn, TensorFlow, and Seaborn etc.
- Helps to prepare data for machine learning.


## What is Raw Data?

Raw data refers to <ins>unprocessed or unrefined data</ins> collected (just gathered data) from various sources, which hasn't been cleaned, organized, or analyzed yet.

<br/>

In [1]:
import pandas as pd

## 01 - Main DataTypes

1. Series (1-dimensional)
2. DataFrames (2-dimensional)

In [4]:
series = pd.Series(["BMW", "Toyota", "Honda"])
series

0       BMW
1    Toyota
2     Honda
dtype: object

<br/>

In [6]:
car_data = pd.DataFrame({"Car make": series, "Colour": ["Red", "Blue", "White"]})
car_data

  Car make Colour
0      BMW    Red
1   Toyota   Blue
2    Honda  White

<br/>

## 02 - Pandas for imported data

In [7]:
# Import Data
car_sales_df = pd.read_csv('car-sales.csv');
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

<br/>

## 03 - Exporting a dataframe

In [9]:
car_sales_df.to_csv("exported-car-sales.csv")

In [13]:
exported_car_sales_df = pd.read_csv("exported-car-sales.csv")
exported_car_sales_df[:5]

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00

> In above dataframe, there is a undefined column named "Unnamed:0", that column known as 'index' column. It should be remove when exporting a dataframe to a CSV file

In [14]:
# Removing 'index' column when exporting a CSV file
car_sales_df.to_csv("exported-car-sales.csv", index=False)

In [15]:
exported_car_sales_df = pd.read_csv("exported-car-sales.csv")
exported_car_sales_df[:5]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

<br/>

## 04 - Describe Data

There are bunch of attributes & methods(functions) in pandas to describe data.

 - Example for an attribute: **car_sales.dtypes**
 - Example for a method: **car_sales.describe()**

In [16]:
car_sales_df.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

<br/>

In [17]:
car_sales_df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

<br/>

In [19]:
car_sales_df.index

RangeIndex(start=0, stop=10, step=1)

<br/><br/>

In [20]:
car_sales_df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

<br/>

In [22]:
car_sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

<br/>

In [35]:
# 'numeric_only' argument skips other types of columns & only choose numeric columns
# Note that: mean() method only works for numerical columns
car_sales_df.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

<br/>

In [36]:
car_prices = pd.Series([3000, 1500, 12150])
car_prices.mean()

5550.0

<br/>

In [37]:
car_sales_df.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [38]:
car_sales_df["Doors"].sum()

40

<br/>

In [39]:
len(car_sales_df)

10

<br/>

## 06 - Manipulating Data

In [221]:
car_sales_df = pd.read_csv('car-sales.csv');
# car_sales_df

In [151]:
car_sales_df[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [152]:
car_sales_df["Make"] = car_sales_df["Make"].str.lower()
car_sales_df[:5]

     Make Colour  Odometer (KM)  Doors       Price
0  toyota  White         150043      4   $4,000.00
1   honda    Red          87899      4   $5,000.00
2  toyota   Blue          32549      3   $7,000.00
3     bmw  Black          11179      5  $22,000.00
4  nissan  White         213095      4   $3,500.00

<br/>

### Dealing with missing values

In [202]:
car_sales_missing_df = pd.read_csv('car-sales-missing-data.csv')
car_sales_missing_df

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White       150043.0    4.0   $4,000.00
1   Honda    Red        87899.0    4.0          NaN
2  Toyota   Blue            NaN    3.0   $7,000.00
3     BMW  Black        11179.0    5.0  $22,000.00
4  Nissan  White       213095.0    NaN   $3,500.00
5  Toyota  Green        99213.0    NaN          NaN
6   Honda    NaN        45698.0    4.0   $7,500.00
7   Honda   Blue            NaN    4.0   $7,000.00
8     NaN  White        60000.0    4.0   $6,250.00
9  Nissan  White        31600.0    4.0   $9,700.00

> Missing values denoted by 'NaN'

<br/>

#### Method 01

In [154]:
mean_odometer = car_sales_missing_df["Odometer (KM)"].mean()
car_sales_missing_df["Odometer (KM)"] = car_sales_missing_df["Odometer (KM)"].fillna(mean_odometer)
car_sales_missing_df

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White     150043.000    4.0   $4,000.00
1   Honda    Red      87899.000    4.0          NaN
2  Toyota   Blue      87340.875    3.0   $7,000.00
3     BMW  Black      11179.000    5.0  $22,000.00
4  Nissan  White     213095.000    NaN   $3,500.00
5  Toyota  Green      99213.000    NaN          NaN
6   Honda    NaN      45698.000    4.0   $7,500.00
7   Honda   Blue      87340.875    4.0   $7,000.00
8     NaN  White      60000.000    4.0   $6,250.00
9  Nissan  White      31600.000    4.0   $9,700.00

#### Method 02

In [166]:
mean_odometer = car_sales_missing_df["Odometer (KM)"].mean()
car_sales_missing_df.fillna({"Odometer (KM)": mean_odometer}, inplace=True)
car_sales_missing_df

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White     150043.000    4.0   $4,000.00
1   Honda    Red      87899.000    4.0          NaN
2  Toyota   Blue      87340.875    3.0   $7,000.00
3     BMW  Black      11179.000    5.0  $22,000.00
4  Nissan  White     213095.000    NaN   $3,500.00
5  Toyota  Green      99213.000    NaN          NaN
6   Honda    NaN      45698.000    4.0   $7,500.00
7   Honda   Blue      87340.875    4.0   $7,000.00
8     NaN  White      60000.000    4.0   $6,250.00
9  Nissan  White      31600.000    4.0   $9,700.00

<br/>

### Get rid of missing values

#### Method 01

In [177]:
car_sales_missing_df = car_sales_missing_df.dropna()
car_sales_missing_df

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White       150043.0    4.0   $4,000.00
3     BMW  Black        11179.0    5.0  $22,000.00
9  Nissan  White        31600.0    4.0   $9,700.00

#### Method 02

In [178]:
car_sales_missing_df.dropna(inplace=True)
car_sales_missing_df

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White       150043.0    4.0   $4,000.00
3     BMW  Black        11179.0    5.0  $22,000.00
9  Nissan  White        31600.0    4.0   $9,700.00

<br/>

In [179]:
# Export filtered data as a CSV file
car_sales_missing_df.to_csv("car-sales-missing-dropped.csv")

<br/>

### Creating data from existing data

In [211]:
car_sales_df[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [212]:
# Column form series
seats_column = pd.Series([5, 5, 5, 5, 5])

# New column called seats
car_sales_df["Seats"] = seats_column
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  Toyota  White         150043      4   $4,000.00    5.0
1   Honda    Red          87899      4   $5,000.00    5.0
2  Toyota   Blue          32549      3   $7,000.00    5.0
3     BMW  Black          11179      5  $22,000.00    5.0
4  Nissan  White         213095      4   $3,500.00    5.0
5  Toyota  Green          99213      4   $4,500.00    NaN
6   Honda   Blue          45698      4   $7,500.00    NaN
7   Honda   Blue          54738      4   $7,000.00    NaN
8  Toyota  White          60000      4   $6,250.00    NaN
9  Nissan  White          31600      4   $9,700.00    NaN

In [213]:
# Fill NaN Seats by value '5'
car_sales_df.fillna({"Seats": 5}, inplace=True)
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  Toyota  White         150043      4   $4,000.00    5.0
1   Honda    Red          87899      4   $5,000.00    5.0
2  Toyota   Blue          32549      3   $7,000.00    5.0
3     BMW  Black          11179      5  $22,000.00    5.0
4  Nissan  White         213095      4   $3,500.00    5.0
5  Toyota  Green          99213      4   $4,500.00    5.0
6   Honda   Blue          45698      4   $7,500.00    5.0
7   Honda   Blue          54738      4   $7,000.00    5.0
8  Toyota  White          60000      4   $6,250.00    5.0
9  Nissan  White          31600      4   $9,700.00    5.0

In [214]:
# Column from Python list
fuel_economy = [7.5, 9.2, 5.0, 9.6, 8.7, 4.5, 6.0, 4.5, 7.1, 5.4]
car_sales_df["Fuel per 100KM"] = fuel_economy
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price  Seats  Fuel per 100KM
0  Toyota  White         150043      4   $4,000.00    5.0             7.5
1   Honda    Red          87899      4   $5,000.00    5.0             9.2
2  Toyota   Blue          32549      3   $7,000.00    5.0             5.0
3     BMW  Black          11179      5  $22,000.00    5.0             9.6
4  Nissan  White         213095      4   $3,500.00    5.0             8.7
5  Toyota  Green          99213      4   $4,500.00    5.0             4.5
6   Honda   Blue          45698      4   $7,500.00    5.0             6.0
7   Honda   Blue          54738      4   $7,000.00    5.0             4.5
8  Toyota  White          60000      4   $6,250.00    5.0             7.1
9  Nissan  White          31600      4   $9,700.00    5.0             5.4

> To create a new column using Python list, list item count must be equals to the dataframe's data count

#### Create a column from another column

In [215]:
car_sales_df["Total fuel used"] = car_sales_df["Odometer (KM)"] / 100 * car_sales_df["Fuel per 100KM"]
car_sales_df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,11253.225
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,8086.708
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,1627.450
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,1073.184
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,18539.265
5,Toyota,Green,99213,4,"$4,500.00",5.0,4.5,4464.585
6,Honda,Blue,45698,4,"$7,500.00",5.0,6.0,2741.880
7,Honda,Blue,54738,4,"$7,000.00",5.0,4.5,2463.210
8,Toyota,White,60000,4,"$6,250.00",5.0,7.1,4260.000
9,Nissan,White,31600,4,"$9,700.00",5.0,5.4,1706.400

#### Create a column from a single value

In [216]:
car_sales_df["Number of wheels"] = 4
car_sales_df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used,Number of wheels
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,11253.225,4
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,8086.708,4
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,1627.450,4
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,1073.184,4
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,18539.265,4
5,Toyota,Green,99213,4,"$4,500.00",5.0,4.5,4464.585,4
6,Honda,Blue,45698,4,"$7,500.00",5.0,6.0,2741.880,4
7,Honda,Blue,54738,4,"$7,000.00",5.0,4.5,2463.210,4
8,Toyota,White,60000,4,"$6,250.00",5.0,7.1,4260.000,4
9,Nissan,White,31600,4,"$9,700.00",5.0,5.4,1706.400,4

> Single value will apply for all the data rows by default

In [217]:
car_sales_df["Passed road safety"] = True
car_sales_df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total fuel used,Number of wheels,Passed road safety
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,11253.225,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,8086.708,4,True
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,1627.450,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,1073.184,4,True
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,18539.265,4,True
5,Toyota,Green,99213,4,"$4,500.00",5.0,4.5,4464.585,4,True
6,Honda,Blue,45698,4,"$7,500.00",5.0,6.0,2741.880,4,True
7,Honda,Blue,54738,4,"$7,000.00",5.0,4.5,2463.210,4,True
8,Toyota,White,60000,4,"$6,250.00",5.0,7.1,4260.000,4,True
9,Nissan,White,31600,4,"$9,700.00",5.0,5.4,1706.400,4,True

In [218]:
car_sales_df.drop("Total fuel used", axis=1, inplace=True)
car_sales_df

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road safety
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4,True
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,4,True
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,4,True
5,Toyota,Green,99213,4,"$4,500.00",5.0,4.5,4,True
6,Honda,Blue,45698,4,"$7,500.00",5.0,6.0,4,True
7,Honda,Blue,54738,4,"$7,000.00",5.0,4.5,4,True
8,Toyota,White,60000,4,"$6,250.00",5.0,7.1,4,True
9,Nissan,White,31600,4,"$9,700.00",5.0,5.4,4,True

> axis 0 == rows | axis 1 == columns

#### Rename column titles

In [219]:
# Single column name
car_sales_df.rename(columns={"Odometer (KM)": "Odometer (Miles)"}, inplace=True)
car_sales_df[:2]

,Make,Colour,Odometer (Miles),Doors,Price,Seats,Fuel per 100KM,Number of wheels,Passed road safety
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4,True

In [220]:
# Multiple columns names
car_sales_df.rename(columns={
    "Odometer (KM)": "Odometer (Miles)", 
    "Number of wheels": "Num of Wheels"
}, inplace=True)

car_sales_df[:2]

,Make,Colour,Odometer (Miles),Doors,Price,Seats,Fuel per 100KM,Num of Wheels,Passed road safety
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4,True

<br/>

### Shuffle rows in a dataframe

In [234]:
car_sales_df = pd.read_csv('car-sales.csv')

In [235]:
# Shuffle & get 50% of data
car_sales_df.sample(frac=0.5)

     Make Colour  Odometer (KM)  Doors       Price
8  Toyota  White          60000      4   $6,250.00
5  Toyota  Green          99213      4   $4,500.00
2  Toyota   Blue          32549      3   $7,000.00
1   Honda    Red          87899      4   $5,000.00
3     BMW  Black          11179      5  $22,000.00

In [236]:
# Shuffle & get all the 100% of data
car_sales_df.sample(frac=1)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
5  Toyota  Green          99213      4   $4,500.00
8  Toyota  White          60000      4   $6,250.00
4  Nissan  White         213095      4   $3,500.00
7   Honda   Blue          54738      4   $7,000.00
3     BMW  Black          11179      5  $22,000.00
1   Honda    Red          87899      4   $5,000.00
9  Nissan  White          31600      4   $9,700.00
6   Honda   Blue          45698      4   $7,500.00
2  Toyota   Blue          32549      3   $7,000.00

In [237]:
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [242]:
# Saving shuffled state
car_sales_shuffled = car_sales_df.sample(frac=1)
car_sales_shuffled

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
8  Toyota  White          60000      4   $6,250.00
3     BMW  Black          11179      5  $22,000.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
1   Honda    Red          87899      4   $5,000.00
5  Toyota  Green          99213      4   $4,500.00
4  Nissan  White         213095      4   $3,500.00
9  Nissan  White          31600      4   $9,700.00
2  Toyota   Blue          32549      3   $7,000.00

<br/>

### Resetting Index

In [240]:
car_sales_shuffled.reset_index(inplace=True)
car_sales_shuffled

   index    Make Colour  Odometer (KM)  Doors       Price
0      9  Nissan  White          31600      4   $9,700.00
1      3     BMW  Black          11179      5  $22,000.00
2      7   Honda   Blue          54738      4   $7,000.00
3      6   Honda   Blue          45698      4   $7,500.00
4      8  Toyota  White          60000      4   $6,250.00
5      4  Nissan  White         213095      4   $3,500.00
6      5  Toyota  Green          99213      4   $4,500.00
7      0  Toyota  White         150043      4   $4,000.00
8      2  Toyota   Blue          32549      3   $7,000.00
9      1   Honda    Red          87899      4   $5,000.00

In [243]:
# Removing 'index' column
car_sales_shuffled.reset_index(drop=True, inplace=True)
car_sales_shuffled

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1  Toyota  White          60000      4   $6,250.00
2     BMW  Black          11179      5  $22,000.00
3   Honda   Blue          45698      4   $7,500.00
4   Honda   Blue          54738      4   $7,000.00
5   Honda    Red          87899      4   $5,000.00
6  Toyota  Green          99213      4   $4,500.00
7  Nissan  White         213095      4   $3,500.00
8  Nissan  White          31600      4   $9,700.00
9  Toyota   Blue          32549      3   $7,000.00

<br/>

### Applying function to a column

In [245]:
car_sales_df["Odometer (KM)"] = car_sales_df["Odometer (KM)"].apply(lambda x: x / 1.6)
car_sales_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White      93776.875      4   $4,000.00
1   Honda    Red      54936.875      4   $5,000.00
2  Toyota   Blue      20343.125      3   $7,000.00
3     BMW  Black       6986.875      5  $22,000.00
4  Nissan  White     133184.375      4   $3,500.00
5  Toyota  Green      62008.125      4   $4,500.00
6   Honda   Blue      28561.250      4   $7,500.00
7   Honda   Blue      34211.250      4   $7,000.00
8  Toyota  White      37500.000      4   $6,250.00
9  Nissan  White      19750.000      4   $9,700.00

> 'lambda' is a special keyword in Python which is short for anonymous function